# Python Mind Map 2
-  
- 
-

## load libraries

In [28]:
import numpy as np
import pandas as pd
from pydataset import data
import string
import random

## Create Data

In [29]:
empid = ['E01', 'E02', 'E03']
empid

['E01', 'E02', 'E03']

In [30]:
#help(print)

In [31]:
for x in range(10) : print(x,  end=',')

0,1,2,3,4,5,6,7,8,9,

In [32]:
df1A = pd.DataFrame(np.random.rand(50,5).round(2))  #5 cols, 50 rows
df1A.head()

      0     1     2     3     4
0  0.54  0.12  0.23  0.30  0.36
1  0.94  0.77  0.04  0.24  0.26
2  0.35  0.85  0.85  0.41  0.13
3  0.87  0.86  0.86  0.10  0.74
4  0.85  0.61  0.52  0.09  0.72

In [33]:
df1A.index = pd.date_range('1/1/2023', periods=len(df1A), freq='M')
df1A.head()

               0     1     2     3     4
2023-01-31  0.54  0.12  0.23  0.30  0.36
2023-02-28  0.94  0.77  0.04  0.24  0.26
2023-03-31  0.35  0.85  0.85  0.41  0.13
2023-04-30  0.87  0.86  0.86  0.10  0.74
2023-05-31  0.85  0.61  0.52  0.09  0.72

In [34]:
string.ascii_uppercase , string.ascii_lowercase

('ABCDEFGHIJKLMNOPQRSTUVWXYZ', 'abcdefghijklmnopqrstuvwxyz')

In [35]:
df1A.shape

(50, 5)

In [36]:
rows, cols = 52, 5

In [37]:
df1B = pd.DataFrame(np.random.randn(rows, cols).round(2),\
                    columns = ['c' + str(i) for i in range(cols)] , \
                    index = list((string.ascii_uppercase + string.ascii_lowercase)[0:rows]))
df1B.head()

     c0    c1    c2    c3    c4
A  1.45 -1.29  1.45 -1.46  0.33
B -0.82 -0.82  0.70  0.62  0.69
C  0.28  0.01 -0.18  0.76  0.95
D -0.13 -0.85  0.56  1.41  0.29
E  0.64 -1.59  1.22  1.60  0.75

In [38]:
df1B['group'] = [random.choice('abcde') for _ in range(rows)]
df1B.head()

     c0    c1    c2    c3    c4 group
A  1.45 -1.29  1.45 -1.46  0.33     d
B -0.82 -0.82  0.70  0.62  0.69     c
C  0.28  0.01 -0.18  0.76  0.95     a
D -0.13 -0.85  0.56  1.41  0.29     b
E  0.64 -1.59  1.22  1.60  0.75     c

In [39]:


df1B

#%%% from dictionary
df2A = pd.DataFrame.from_dict({'R0':{'C1':0, 'C2':'A'}, 'R1':{'C1':10, 'C2':'B'}}, orient='index')
df2A
df2B = pd.DataFrame.from_dict({'R0':[1,2,3], 'R1':[5,6,7]}, orient='index', columns=['C3','C4','C5'])
df2B
#%%% create data frame
n=50
empID = random.sample(range(100,300),n)
empID
depts = ['HR','Marketing', 'Finance', 'Operations']
name = pd.Series(['Employee' + str(i) for i in range(1,n+1)])
name
age = np.random.randint(low=23, high=50, size=n)
age
gender = random.choices(['M','F'], weights =(.7,.3), k=n)
dept = random.choices(depts, k=n)
pd.DataFrame({'empID':empID, 'name':name, 'gender':gender, 'dept':dept, 'age':age, 'salary':salary})
salary = np.random.randint(low=10000, high=100000, size=n)
appraisal = np.random.normal(loc=7,scale=1,size=n).round(n)
appraisal
sDate = '2020/01/01'; eDate ='2023/01/01'
sampleDates = pd.date_range(sDate, eDate).to_series()
sampleDates
len(appraisal)
doj = sampleDates.sample(n, replace=False, random_state=100)
type(doj)
dojList = doj.tolist()
len(dojList)
myList1 = [empID, name, gender, dept, age, salary, appraisal, doj]
for i in myList1: print(len(i))
df3 = pd.DataFrame({'empID':empID, 'name':name, 'gender':gender, 'dept':dept, 'age':age, 'salary':salary, 'appraisal':appraisal, 'doj':dojList})
df3

df3['raiseLY'] = [random.choice('YN')  for _ in range(len(df3))]
df3['married'] = [random.choice([True,False, np.NaN])  for _ in range(len(df3))]
df3[['raiseLY','married']]
df3['distOffice'] = np.random.randint(low=3, high=25, size=n)
rRows = np.random.randint(low=0, high=n, size=round(n/4))
rRows
df3.loc[rRows, 'distOffice'] = np.nan
df3.isnull().sum()

cities = ('Gurugram', 'Noida','Delhi', 'Mumbai', 'Bengaluru','Chennai', 'Kolkatta')
random.sample(cities, counts=[4,13,2,14,2,12,4], k=n)
df3['homeTown'] = np.random.choice(cities, size=50, replace=True)
df3['homeTown'].tolist()

NameError: name 'salary' is not defined

## Load DataSet

In [5]:
#inbuilt data
mt = data('mtcars')
mt.shape

(32, 11)

In [ ]:
#excel, csv

## Describe Data